---
kind: enumMember
id: F:Autodesk.Revit.DB.TextElementBackground.TBGR_OPAQUE
enum: Autodesk.Revit.DB.TextElementBackground
source: html/b0d50ea6-86c2-afcd-4e0c-34c59204384e.htm
---
# Autodesk.Revit.DB.TextElementBackground.TBGR_OPAQUE

The TextElement object is opaque.